# 衣服數據庫 服裝圖片標籤
# 1.合身 2.寬鬆 Fit
# 1.日系 2.韓系 Style
# 1.休閒 2.正式 Type
# 1.藍 2.白 3.紅 4.綠 5.黑 (五個之前的顏色) (color)

clothes = [
    {"id": 1, "vector": [1, 1, 2, 1]}, 
    {"id": 2, "vector": [1, 1, 1, 1]},  
    {"id": 3, "vector": [1, 1, 1, 5]},
    {"id": 4, "vector": [2, 2, 2, 1]},
    {"id": 5, "vector": [1, 2, 1, 5]},
    {"id": 6, "vector": [1, 2, 1, 5]},
    {"id": 7, "vector": [1, 2, 1, 5]},
    {"id": 8, "vector": [1, 2, 1, 5]},
    {"id": 9, "vector": [1, 1, 2, 1]},
    {"id": 10, "vector": [1, 1, 2, 1]},
    {"id": 11, "vector": [2, 1, 2, 4]},
    {"id": 12, "vector": [2, 1, 2, 4]},
    {"id": 13, "vector": [2, 1, 2, 4]},
    {"id": 14, "vector": [1, 2, 1, 4]},
    {"id": 15, "vector": [1, 1, 2, 3]},
    {"id": 16, "vector": [1, 1, 2, 2]},
    {"id": 17, "vector": [1, 1, 2, 2]},
    {"id": 18, "vector": [1, 1, 2, 3]},
    {"id": 19, "vector": [2, 2, 1, 2]},
    {"id": 20, "vector": [2, 2, 1, 2]},
    {"id": 21, "vector": [2, 1, 1, 3]},
    {"id": 22, "vector": [2, 1, 1, 3]},
    {"id": 23, "vector": [2, 1, 1, 3]},
    {"id": 24, "vector": [2, 1, 1, 3]},
    {"id": 25, "vector": [1, 1, 1, 2]},
    {"id": 26, "vector": [1, 1, 1, 2]},
    {"id": 27, "vector": [1, 2, 1, 2]},
    {"id": 28, "vector": [1, 2, 1, 2]},
    {"id": 29, "vector": [1, 2, 1, 2]},
    {"id": 30, "vector": [2, 1, 2, 2]},
    {"id": 31, "vector": [2, 1, 2, 2]},
    {"id": 32, "vector": [2, 1, 2, 2]},
    {"id": 33, "vector": [2, 1, 2, 2]},
    {"id": 34, "vector": [2, 1, 2, 2]},
]